package io.github.n7m.single.core.util.enums;
// +----------------------------------------------------------------------
// | 官方网站: www.365d1.com
// +----------------------------------------------------------------------
// | 功能描述: 
// +----------------------------------------------------------------------
// | 时　　间: 2021/11/9
// +----------------------------------------------------------------------
// | 代码创建: 朱荻 <292018748@qq.com>
// +----------------------------------------------------------------------
// | 版本信息: V1.0.0
// +----------------------------------------------------------------------
// | 代码修改:（修改人 - 修改时间）
// +----------------------------------------------------------------------

import lombok.AllArgsConstructor;
import lombok.Getter;

@Getter
@AllArgsConstructor
public enum DataPermissionEnum implements Dictionary<Integer> {

    HIDDEN("隐藏", 0),
    EQ("等于", 1),
    GT("大于", 2),
    GE("大于等于", 3),
    LT("小于", 4),
    LE("小于等于", 5),
    NE("不等于", 6),
    LIKE("模糊匹配", 7),
    BETWEEN("区间内", 8),
    NOTBETWEEN("区间外", 9),
    IN("列表内", 10),
    NOTIN("列表外", 11);

    private String key;
    private Integer value;

}
