package io.github.n7m.single.core.service;
// +----------------------------------------------------------------------
// | 官方网站: www.365d1.com
// +----------------------------------------------------------------------
// | 功能描述: 
// +----------------------------------------------------------------------
// | 时　　间: 2022/10/18 14:40
// +----------------------------------------------------------------------
// | 代码创建: 朱荻 <292018748@qq.com>
// +----------------------------------------------------------------------
// | 版本信息: V 0.0.1
// +----------------------------------------------------------------------
// | 代码修改:（修改人 - 修改时间）
// +----------------------------------------------------------------------

import com.baomidou.mybatisplus.core.metadata.IPage;

import java.util.List;

public interface N7mCommonService {

    <T> IPage<T> queryUserPage(String search, Integer type, String depart, Integer page);

    <T> List<T> queryDepartTree(String parentId);

}
